test/tsung.config.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/user/share/tsung/tsung-1.0.dtd">
<tsung loglevel="warning" version="1.0">

  <clients>
    <client host="localhost" cpu="1" use_controller_vm="true" maxusers="300000" />
  </clients>

  <servers>
    <server host="dev.shawarmaspin.com" port="80" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="minute">
      <users maxnumber="5000" arrivalrate="1" unit="second" />
    </arrivalphase>
  </load>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/socket/websocket"></websocket>
      </request>

      <request subst="true">
        <websocket type="message">{"topic":"arenas:lobby", "event":"phx_join", "payload": {}, "ref":"1"}</websocket>
      </request>

      <thinktime value="5" random="true" />

<!--
      <request subst="true">
        <websocket type="message">{"topic":"arenas:lobby", "event":"shout", "payload": {"message": "spin"}, "ref":"1"}</websocket>
      </request>

      <thinktime value="5" random="true" />
-->

      <request subst="true">
        <websocket type="message">{"topic":"arenas:squads:STI", "event":"phx_join", "payload": {}, "ref":"1"}</websocket>
      </request>

      <thinktime value="5" random="true" />

      <request subst="true">
        <websocket type="message">{"topic":"arenas:squads:STI", "event":"shout", "payload": {"message": "spin"}, "ref":"1"}</websocket>
      </request>

      <thinktime value="120" />
    </session>
  </sessions>

</tsung>